backend/app/controllers/pubs_controller.rb

SELECT "pubs".* FROM "pubs"
---
  def index
    @pubs = Pub.all