app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
  def fetch_user
    # check if session[:user_id] is set, and also if it stores a valid ID, and if so, set an instance varibale containing the user object

    if session[:user_id].present?
      @current_user = User.find_by id: session[:user_id]