app/controllers/orders_controller.rb

  def create

    @order = Order.new user: @current_user

    respond_to do |format|
      if @order.save

        # can't use .where syntax because it removes duplicates,
        # and we need them for ordering multiples of the same drinks
        # TODO: add LineItem model to order to track quantities for each drink
        # @order.drinks << Drink.where( ids: params[:drink_ids] )
        p "drink IDs:", params[:drink_ids]
        order_drinks = params[:drink_ids].map{ |id| Drink.find id }
        p "drink objects: ", order_drinks
        @order.drinks << order_drinks
---
INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 22], ["created_at", "2018-11-28 05:30:04.861223"], ["updated_at", "2018-11-28 05:30:04.861223"]]
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT $2  [["id", 70], ["LIMIT", 1]]
INSERT INTO "drinks_orders" ("order_id", "drink_id") VALUES ($1, $2) RETURNING "id"  [["order_id", 24], ["drink_id", 70]]