app/controllers/pubs_controller.rb

  def index
    @pubs = Pub.all
---
SELECT "pubs".* FROM "pubs"

  def show
    @pub = Pub.find(params[:id])
---
SELECT  "pubs".* FROM "pubs" WHERE "pubs"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]

  def search
    render json: Pub.where('name || location ILIKE ?', "%#{params[:query]}%")
---
SELECT "pubs".* FROM "pubs" WHERE (name || location ILIKE '%new%')

    def set_pub
      @pub = Pub.find(params[:id])
---
SELECT  "pubs".* FROM "pubs" WHERE "pubs"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]