app/controllers/users_controller.rb

  def edit
    @user = User.find_by id: session[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "Yianni"], ["email", "yianni.m13@gmail.com"], ["password_digest", "chicken"], ["created_at", "2018-11-23 05:27:53.377816"], ["updated_at", "2018-11-23 05:27:53.377816"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "yianni@heybrew.io"], ["updated_at", "2018-11-24 04:06:03.707407"], ["id", 1]]